'''
https://docs.python.org/ko/3/reference
'''


def main():
    # 타입에 상관 없이 출력 가능
    print("{0}".format(500))  # 500

    # {0} -> {0:>10} : 공간 10칸을 확보한 상태에서 오른쪽 정렬
    # 빈 공간은 빈 칸으로 두기
    print("{0: >10}".format(500))  #        500

    # 빈 공간을 b로 채우기
    print("{0:b>10}".format(500))  # bbbbbbb500

    # '+' 붙이기
    print("{0: >+10}".format(500))  #       +500
    print("{0: >10}".format(-500))  #       -500

    # 오른쪽 정렬, 빈자리는 '_'로 채우기
    print("{0:_<10}".format(500))  # 500_______

    # 천 단위 기호를 숫자 3자리마다 ',' 표시
    print("{0:,}".format(1000000000))  # 1,000,000,000

    # '+', '-' 붙이기
    print("{0:+,}".format(1000000000))  # +1,000,000,000
    print("{0:+,}".format(-1000000000))  # -1,000,000,000

    # 반올림
    print("{0}".format(5 / 3))  # 1.6666666666666667
    print("{0:f}".format(5 / 3))  # 1.666667
    print("{0:.2f}".format(5 / 3))  # 1.67

main()
